# Cleaning Financial Data

Here, we clean financial actuals data and pare it down just to what we need for performance (original file is 5 million rows)

In [1]:
import pandas as pd

In [2]:
# Source
# https://tea.texas.gov/finance-and-grants/state-funding/state-funding-reports-and-data/peims-multiple-file-financial-data-downloads

filename = 'ACTUAL_2020F.TXT'

In [7]:
df = pd.read_csv(
    filename, 
    header=0, 
    names=['District','Fund','Function','Object','Fin Unit', 'Program Intent', 'Fund Year','Account Amount', 'DT Update'],
    dtype={'District': str, 'Fin Unit': str}
)

In [11]:
df['Campus'] = pd.to_numeric(df['District'] + df['Fin Unit'])

In [25]:
amount_df = df[['Campus','Account Amount']]
total_expenditures = amount_df.groupby(['Campus']).sum()

In [29]:
el_df = df.loc[df['Program Intent'] == 25][['Campus','Account Amount']]
el_df = el_df.rename(columns={'Account Amount': 'Bilingual Spending'})
el_expenditures = el_df.groupby(['Campus']).sum()
el_expenditures

           Bilingual Spending
Campus
1902001                 11055
1906002                  3984
1907001                 61054
1907101                151407
1907102                   647
...                       ...
254901104                1737
254901106                3642
254902001                1436
254902101                1526
254902999                 179

[7181 rows x 1 columns]

In [30]:
spending_df = total_expenditures.join(el_expenditures, on='Campus')
spending_df

           Account Amount  Bilingual Spending
Campus
1902000          13569506                 NaN
1902001           1757090             11055.0
1902041           1116480                 NaN
1902103           1677016                 NaN
1902701            120881                 NaN
...                   ...                 ...
254902701          292122                 NaN
254902702           13480                 NaN
254902703           88571                 NaN
254902750          182122                 NaN
254902999         3049184               179.0

[15266 rows x 2 columns]

In [31]:
spending_df.to_csv('ACTUAL_2020F_SUMMED.csv')

In [ ]:
# Bilingual expenditure might be interesting to correlate with EL students
programs = {
    11: 'Regular',
    22: 'Career & Technical',
    23: 'Students with Disabilities',
    25: 'Bilingual'
}